# TITANIC DATASET

In [977]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## Loading Train dataset

In [978]:
train=pd.read_csv('/kaggle/input/titanic/train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Loading Test dataset

In [979]:
test=pd.read_csv('/kaggle/input/titanic/test.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# DATA CLEANING

## For Train dataset

In [980]:
train.shape

(891, 12)

In [981]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Drop unwanted columns

In [982]:
train.drop(['Name','Ticket','Fare'],axis=1,inplace=True)

## To check for null values for train dataset

In [983]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Cabin          687
Embarked         2
dtype: int64

In [984]:
train.replace('-','nan')
train.replace('na','nan')

     PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch Cabin Embarked
0              1         0       3    male  22.0      1      0   NaN        S
1              2         1       1  female  38.0      1      0   C85        C
2              3         1       3  female  26.0      0      0   NaN        S
3              4         1       1  female  35.0      1      0  C123        S
4              5         0       3    male  35.0      0      0   NaN        S
..           ...       ...     ...     ...   ...    ...    ...   ...      ...
886          887         0       2    male  27.0      0      0   NaN        S
887          888         1       1  female  19.0      0      0   B42        S
888          889         0       3  female   NaN      1      2   NaN        S
889          890         1       1    male  26.0      0      0  C148        C
890          891         0       3    male  32.0      0      0   NaN        Q

[891 rows x 9 columns]

In [985]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Cabin          687
Embarked         2
dtype: int64

## Filling the null values

In [986]:
train['Age'].mean()

29.69911764705882

In [987]:
train['Age'].median()

28.0

In [988]:
train['Age'].fillna(train['Age'].mean(),inplace=True)

In [989]:
train['Embarked'].fillna(train['Embarked'].mode()[0],inplace=True)

### Cabin column contains 80% of null values so we can drop it

In [990]:
train.drop(['Cabin'],axis=1,inplace=True)

In [991]:
train.skew()

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

PassengerId    0.000000
Survived       0.478523
Pclass        -0.630548
Age            0.434488
SibSp          3.695352
Parch          2.749117
dtype: float64

In [992]:
train.describe()

       PassengerId    Survived      Pclass         Age       SibSp       Parch
count   891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008    0.381594
std     257.353842    0.486592    0.836071   13.002015    1.102743    0.806057
min       1.000000    0.000000    1.000000    0.420000    0.000000    0.000000
25%     223.500000    0.000000    2.000000   22.000000    0.000000    0.000000
50%     446.000000    0.000000    3.000000   29.699118    0.000000    0.000000
75%     668.500000    1.000000    3.000000   35.000000    1.000000    0.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000    6.000000

In [993]:
q1=train['SibSp'].quantile(0.25)
q2=train['SibSp'].quantile(0.75)
q1

0.0

In [994]:
q2

1.0

In [995]:
train['SibSp']=np.where(train['SibSp']<q1,q1,train['SibSp'])
train['SibSp']=np.where(train['SibSp']>q2,q2,train['SibSp'])
train.skew()

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  This is separate from the ipykernel package so we can avoid doing imports until

PassengerId    0.000000
Survived       0.478523
Pclass        -0.630548
Age            0.434488
SibSp          0.784821
Parch          2.749117
dtype: float64

In [996]:
train['Parch']=np.sqrt(train['Parch'])
train['Parch'].skew()

1.5297990732860154

In [997]:
train.skew()

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

PassengerId    0.000000
Survived       0.478523
Pclass        -0.630548
Age            0.434488
SibSp          0.784821
Parch          1.529799
dtype: float64

### Changing categorical value to numerical

In [998]:
dummies=pd.get_dummies(train['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [999]:
train=pd.concat([train,dummies],axis='columns')
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Embarked,female,male
0,1,0,3,male,22.0,1.0,0.0,S,0,1
1,2,1,1,female,38.0,1.0,0.0,C,1,0
2,3,1,3,female,26.0,0.0,0.0,S,1,0
3,4,1,1,female,35.0,1.0,0.0,S,1,0
4,5,0,3,male,35.0,0.0,0.0,S,0,1

In [1000]:
train.drop(['Sex','female'],axis=1,inplace=True)
train.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch Embarked  male
0            1         0       3  22.0    1.0    0.0        S     1
1            2         1       1  38.0    1.0    0.0        C     0
2            3         1       3  26.0    0.0    0.0        S     0
3            4         1       1  35.0    1.0    0.0        S     0
4            5         0       3  35.0    0.0    0.0        S     1

In [1001]:
dummies1=pd.get_dummies(train['Embarked'])
dummies1.head()

   C  Q  S
0  0  0  1
1  1  0  0
2  0  0  1
3  0  0  1
4  0  0  1

In [1002]:
train=pd.concat([train,dummies1],axis='columns')
train.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch Embarked  male  C  Q  S
0            1         0       3  22.0    1.0    0.0        S     1  0  0  1
1            2         1       1  38.0    1.0    0.0        C     0  1  0  0
2            3         1       3  26.0    0.0    0.0        S     0  0  0  1
3            4         1       1  35.0    1.0    0.0        S     0  0  0  1
4            5         0       3  35.0    0.0    0.0        S     1  0  0  1

In [1003]:
train.drop(['Embarked','C'],axis=1,inplace=True)
train.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch  male  Q  S
0            1         0       3  22.0    1.0    0.0     1  0  1
1            2         1       1  38.0    1.0    0.0     0  0  0
2            3         1       3  26.0    0.0    0.0     0  0  1
3            4         1       1  35.0    1.0    0.0     0  0  1
4            5         0       3  35.0    0.0    0.0     1  0  1

### Finding correlation

In [1004]:
train.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,male,Q,S
PassengerId,1.000000,-0.005007,-0.035144,0.033207,-0.053397,0.000348,0.042939,-0.033606,0.022204
Survived,-0.005007,1.000000,-0.338481,-0.069809,0.115867,0.121652,-0.543351,0.003650,-0.149683
Pclass,-0.035144,-0.338481,1.000000,-0.331339,-0.076009,-0.006792,0.131900,0.221009,0.074053
Age,0.033207,-0.069809,-0.331339,1.000000,-0.148409,-0.237261,0.084153,-0.013855,-0.019336
SibSp,-0.053397,0.115867,-0.076009,-0.148409,1.000000,0.404346,-0.203203,-0.055398,0.004412
Parch,0.000348,0.121652,-0.006792,-0.237261,0.404346,1.000000,-0.257096,-0.095097,0.049494
male,0.042939,-0.543351,0.131900,0.084153,-0.203203,-0.257096,1.000000,-0.074115,0.119224
Q,-0.033606,0.003650,0.221009,-0.013855,-0.055398,-0.095097,-0.074115,1.000000,-0.499421
S,0.022204,-0.149683,0.074053,-0.019336,0.004412,0.049494,0.119224,-0.499421,1.000000

### Spliting x_train and y_train

In [1005]:
x_train=train.iloc[:,2:]
y_train=train.Survived

In [1006]:
x_train

     Pclass        Age  SibSp     Parch  male  Q  S
0         3  22.000000    1.0  0.000000     1  0  1
1         1  38.000000    1.0  0.000000     0  0  0
2         3  26.000000    0.0  0.000000     0  0  1
3         1  35.000000    1.0  0.000000     0  0  1
4         3  35.000000    0.0  0.000000     1  0  1
..      ...        ...    ...       ...   ... .. ..
886       2  27.000000    0.0  0.000000     1  0  1
887       1  19.000000    0.0  0.000000     0  0  1
888       3  29.699118    1.0  1.414214     0  0  1
889       1  26.000000    0.0  0.000000     1  0  0
890       3  32.000000    0.0  0.000000     1  1  0

[891 rows x 7 columns]

In [1007]:
y_train

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

## For Test dataset

In [1008]:
test.shape

(418, 11)

In [1009]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

## Drop unwanted columns

In [1010]:
test.drop(['Name','Ticket','Fare'],axis=1,inplace=True)

## To check for null values for test dataset

In [1011]:
test.isnull().sum()

PassengerId      0
Pclass           0
Sex              0
Age             86
SibSp            0
Parch            0
Cabin          327
Embarked         0
dtype: int64

In [1012]:
test.replace('-','nan')
test.replace('na','nan')

     PassengerId  Pclass     Sex   Age  SibSp  Parch Cabin Embarked
0            892       3    male  34.5      0      0   NaN        Q
1            893       3  female  47.0      1      0   NaN        S
2            894       2    male  62.0      0      0   NaN        Q
3            895       3    male  27.0      0      0   NaN        S
4            896       3  female  22.0      1      1   NaN        S
..           ...     ...     ...   ...    ...    ...   ...      ...
413         1305       3    male   NaN      0      0   NaN        S
414         1306       1  female  39.0      0      0  C105        C
415         1307       3    male  38.5      0      0   NaN        S
416         1308       3    male   NaN      0      0   NaN        S
417         1309       3    male   NaN      1      1   NaN        C

[418 rows x 8 columns]

In [1013]:
test.isnull().sum()

PassengerId      0
Pclass           0
Sex              0
Age             86
SibSp            0
Parch            0
Cabin          327
Embarked         0
dtype: int64

## Filling the null values

In [1014]:
test['Age'].fillna(test['Age'].mean(),inplace=True)

In [1015]:
test['Embarked'].fillna(test['Embarked'].mode()[0],inplace=True)

### Cabin column contains 80% of null values so we can drop it

In [1016]:
test.drop(['Cabin'],axis=1,inplace=True)

In [1017]:
test.skew()

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

PassengerId    0.000000
Pclass        -0.534170
Age            0.512711
SibSp          4.168337
Parch          4.654462
dtype: float64

In [1018]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch
count   418.000000  418.000000  418.000000  418.000000  418.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344
std     120.810458    0.841838   12.634534    0.896760    0.981429
min     892.000000    1.000000    0.170000    0.000000    0.000000
25%     996.250000    1.000000   23.000000    0.000000    0.000000
50%    1100.500000    3.000000   30.272590    0.000000    0.000000
75%    1204.750000    3.000000   35.750000    1.000000    0.000000
max    1309.000000    3.000000   76.000000    8.000000    9.000000

In [1019]:
q1=test['SibSp'].quantile(0.25)
q2=test['SibSp'].quantile(0.75)
q1

0.0

In [1020]:
q2

1.0

In [1021]:
test['SibSp']=np.where(test['SibSp']<q1,q1,test['SibSp'])
test['SibSp']=np.where(test['SibSp']>q2,q2,test['SibSp'])
test.skew()

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  This is separate from the ipykernel package so we can avoid doing imports until

PassengerId    0.000000
Pclass        -0.534170
Age            0.512711
SibSp          0.759914
Parch          4.654462
dtype: float64

In [1022]:
test['Parch']=np.sqrt(test['Parch'])
test['Parch'].skew()

1.8791559278126866

In [1023]:
test.skew()

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

PassengerId    0.000000
Pclass        -0.534170
Age            0.512711
SibSp          0.759914
Parch          1.879156
dtype: float64

### Changing categorical value to numerical

In [1024]:
dummies=pd.get_dummies(test['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [1025]:
test=pd.concat([test,dummies],axis='columns')
test.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch Embarked  female  male
0          892       3    male  34.5    0.0    0.0        Q       0     1
1          893       3  female  47.0    1.0    0.0        S       1     0
2          894       2    male  62.0    0.0    0.0        Q       0     1
3          895       3    male  27.0    0.0    0.0        S       0     1
4          896       3  female  22.0    1.0    1.0        S       1     0

In [1026]:
test.drop(['Sex','female'],axis=1,inplace=True)
test.head()

   PassengerId  Pclass   Age  SibSp  Parch Embarked  male
0          892       3  34.5    0.0    0.0        Q     1
1          893       3  47.0    1.0    0.0        S     0
2          894       2  62.0    0.0    0.0        Q     1
3          895       3  27.0    0.0    0.0        S     1
4          896       3  22.0    1.0    1.0        S     0

In [1027]:
dummies1=pd.get_dummies(test['Embarked'])
dummies1.head()

   C  Q  S
0  0  1  0
1  0  0  1
2  0  1  0
3  0  0  1
4  0  0  1

In [1028]:
test=pd.concat([test,dummies1],axis='columns')
test.head()

   PassengerId  Pclass   Age  SibSp  Parch Embarked  male  C  Q  S
0          892       3  34.5    0.0    0.0        Q     1  0  1  0
1          893       3  47.0    1.0    0.0        S     0  0  0  1
2          894       2  62.0    0.0    0.0        Q     1  0  1  0
3          895       3  27.0    0.0    0.0        S     1  0  0  1
4          896       3  22.0    1.0    1.0        S     0  0  0  1

In [1029]:
test.drop(['Embarked','C'],axis=1,inplace=True)
test.head()

   PassengerId  Pclass   Age  SibSp  Parch  male  Q  S
0          892       3  34.5    0.0    0.0     1  1  0
1          893       3  47.0    1.0    0.0     0  0  1
2          894       2  62.0    0.0    0.0     1  1  0
3          895       3  27.0    0.0    0.0     1  0  1
4          896       3  22.0    1.0    1.0     0  0  1

In [1030]:
test.corr()

,PassengerId,Pclass,Age,SibSp,Parch,male,Q,S
PassengerId,1.000000,-0.026751,-0.030874,-0.007059,0.048247,0.023245,-0.035731,0.048008
Pclass,-0.026751,1.000000,-0.440782,-0.145113,-0.021851,0.108615,0.252608,0.120783
Age,-0.030874,-0.440782,1.000000,0.034531,-0.102107,0.000011,-0.012719,-0.136822
SibSp,-0.007059,-0.145113,0.034531,1.000000,0.391452,-0.158564,-0.161134,0.029944
Parch,0.048247,-0.021851,-0.102107,0.391452,1.000000,-0.210501,-0.164888,0.071887
male,0.023245,0.108615,0.000011,-0.158564,-0.210501,1.000000,-0.115574,0.105883
Q,-0.035731,0.252608,-0.012719,-0.161134,-0.164888,-0.115574,1.000000,-0.474962
S,0.048008,0.120783,-0.136822,0.029944,0.071887,0.105883,-0.474962,1.000000

In [1031]:
x_test=test.iloc[:,1:]

In [1032]:
from sklearn.linear_model import LogisticRegression
model=LogisticRegression()
model.fit(x_train,y_train)

LogisticRegression()

In [1033]:
y_pred=model.predict(x_test)

In [1034]:
y_pred

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0])

In [1035]:
data=pd.DataFrame(y_pred,columns=['survived'])

In [1036]:
data

     survived
0           0
1           0
2           0
3           0
4           1
..        ...
413         0
414         1
415         0
416         0
417         0

[418 rows x 1 columns]

In [1037]:
data1=pd.DataFrame(test.PassengerId)

In [1038]:
data1

     PassengerId
0            892
1            893
2            894
3            895
4            896
..           ...
413         1305
414         1306
415         1307
416         1308
417         1309

[418 rows x 1 columns]

In [1039]:
result=pd.concat([data1,data],axis=1)
result

     PassengerId  survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [1040]:
result

     PassengerId  survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [1041]:
result.to_csv('kaggle_titanic.csv',index=False)